using System;

namespace _2.Radians
{
    class Program
    {
        static void Main(string[] args)
        {
            // ⦁	Прочетете входните данни от конзолата(радианите):
            // ⦁	Създайте нова променлива, в която ще направите 
            //      конвертирането от радиани към градуси, като знаете формулата 
            //      за изчисление:
            // ⦁	Принтирайте получените градуси, като закръглите резултата цяло число
            //      (използвайте метода Math.Round()):

            // Напишете програма, която чете ъгъл в радиани(rad) и го 
            //      преобразува в градуси(deg).Използвайте формулата:
            //      градус = радиан * 180 / π.Числото π в C# програми е достъпно
            //       чрез Math.PI. Закръглете резултата до най-близкото 
            //       цяло число използвайки Math.Round().

            double radians = double.Parse(Console.ReadLine());
            double degrees = radians * 180 / Math.PI;
            Console.WriteLine(Math.Round(degrees));

        }
    }
}
